function p322
%基于汽车发动机故障诊断的实例分析
%1为正常；2为油量少；3为气门漏气；4为汽缸漏气。
p=[0.999 0.999 0.999 0.999 0.999 0.999;0.102 0.091 0.035 0.085 0.078 0.105;
    0.111 0.125 0.021 0.078 0.121 0.192;0.215 0.185 0.152 0.098 0.115 0.113]';
t=[1 0 0 0;0 1 0 0;0 0 1 0;0 0 0 1]';
for i=1:5
    net=newpnn(p,t,i/10);
    temp=sim(net,p);
    yc=vec2ind(temp);
end
yc
disp('请输入测试样本数据组个数:')
n=input('');
p_test=[1.001 1.002 0.999 1.000 1.006 0.998;0.115 0.131 0.019 0.083 0.123 0.202;
    0.110 0.102 0.031 0.091 0.082 0.096;0.221 0.193 0.148 0.105 0.121 0.110]';
y_test=sim(net,p_test);
yc_test=vec2ind(y_test);
yc_test
for i=1:n
    c=yc_test(i);
end 
yc_test
switch(c)
    case 1
        disp('正常')
    case 2
        disp('油量少');
    case 3
        disp('气门漏气');
    case 4
        disp('汽缸漏气');
    otherwise
        disp('未知故障');
end